Autodesk.Revit.DB.CompoundStructureDeckUsage
Describes how the deck relates to the surrounding layers.

Autodesk.Revit.DB.CompoundStructureDeckUsage.MergeWithLayerBelow
Deck is merged with the layer below.

Autodesk.Revit.DB.CompoundStructureDeckUsage.Standalone
Deck is independent of other layers.

Autodesk.Revit.DB.CompoundStructureDeckUsage.MergeWithLayerAbove
Deck is merged with the layer above.

Autodesk.Revit.DB.CompoundStructureDeckUsage.Invalid
Invalid.